# ============================================================
#  config.py  —  ตั้งค่าการเชื่อมต่อฐานข้อมูล MySQL
# ============================================================
#  ★ นิสิตต้องแก้ 4 บรรทัดนี้ให้เป็น user / password ของตัวเอง
#    (ที่อาจารย์แจกให้สำหรับเชื่อมต่อ database server ของวิชา)
# ============================================================

#สามารถ connect เป็น localhost ในเครื่องตัวเองได้
DB_HOST = "localhost"
DB_USER = "root"
DB_PASSWORD = "abcd1234"  
DB_NAME = "course_db"
DB_PORT = 3306
